#include <stdio.h>
//Цей код виконує обчислення добутку всіх чисел, кратних 7, у діапазоні від 22 до 100 включно (бо 21 не кратне 7)
int main() {
    //Змінна product позначається  значенням 1, щоб можна було виконати множення на кожний цикл. 
    int product = 1;
    int i = 22;
    //Цикл do-while виконується, доки значення i менше або дорівнює 100. На кожній ітерації перевіряється, чи є i кратним 7 за допомогою оператора %. 
    do {
        if (i % 7 == 0) {
            product *= i;
        }
        i++;
    } while (i <= 100);
    printf("Добуток всіх чисел, кратних 7, у діапазоні (21;100]: %d\n", product);
    return 0;
}